//----------------------------------------------------------------------------

//Модуль реализации выполнения команд Wake: header file

//----------------------------------------------------------------------------

#ifndef CommandsH
#define CommandsH

#include "Port.h"
#include "Wake.h"

//-------------------------------- Константы: --------------------------------

//Коды специальных команд:

#define CMD_SETMODE    6 //установка режима управления
#define CMD_GETMODE    7 //чтение режима управления
#define CMD_SETPAR     8 //установка параметра
#define CMD_GETPAR     9 //чтение параметра
#define CMD_GETSELPAR 10 //чтение текущего параметра

//----------------------------------------------------------------------------


//---------------------------- Прототипы функций: ----------------------------

void Commands_Exe(void); 					//выполнение команд
void Tx_Replay(char n, char err); //передача ответа на команду

//----------------------------------------------------------------------------

#endif
