//----------------------------------------------------------------------------

//Модуль реализации выполнения команд Wake: header file

//----------------------------------------------------------------------------

#ifndef CommandsH
#define CommandsH

#include "Port.h"
#include "Wake.h"

//-------------------------------- Константы: --------------------------------

//Коды специальных команд:
#define powerButton      0x21     /**< Питание (вкл/выкл) (1/0) */
#define lightButton      0x22     /**< Свет (вкл/выкл) (1/0) */
#define powerStatus      0x41     /**< Питание (вкл/выкл) (1/0) */
#define lightStatus      0x42     /**< Свет (вкл/выкл) (1/0) */
#define soundSignal      0x23     /**< Гудок (вкл/выкл) (1/0) */
#define speedButton 		 0x24     /**< Скорость (медленно/быстро) (0/1..9) */
#define highTemperature  0x31     /**< Перегрев ОЖ (нет/есть) (0/1) */
#define hookWarning      0x32     /**< Ограничитель подъема (срабатывание/норм.работа) (1/0) */
#define modeCrOrP        0x51     /**< Режим работы - Опоры или Cтойка, стрела, лебедка (1/0) */
#define modeCrOrPStatus  0x52     /**< Режим работы - Опоры или Cтойка, стрела, лебедка (1/0) */

#define pillar           0x25     /**< Поворот стойки (-128..127) */
#define derrick          0x27     /**< Подъемная стрела (-128..127) */
#define outrigger        0x29     /**< Выносная стрела (-128..127) */
#define telescopic       0x2B     /**< Телескопическая стрела (-128..127) */
#define hook             0x2D     /**< Лебедка(крюк) (-128..127) */
#define leftCrutch       0x2F     /**< Левая опора (-128..127) */
#define rightCrutch      0x2E     /**< Правая опора (-128..127) */

#define SEND_REPLY       0        /**< Отправлять ответ на команды управления элементами КМУ*/

//----------------------------------------------------------------------------


//---------------------------- Прототипы функций: ----------------------------

void Commands_Exe(void); 					//выполнение команд
void Tx_Replay(char n, char err); //передача ответа на команду

//----------------------------------------------------------------------------

#endif
