//----------------------------------------------------------------------------

//Модуль реализации протокола Wake: header file

//----------------------------------------------------------------------------

#ifndef PortH
#define PortH

//----------------------------------------------------------------------------

#include <MDR32F9x.h>
#include "MDR32F9x_config.h"
#include "Wake.h"

//----------------------------------------------------------------------------


//-------------------------------- Константы: --------------------------------

typedef unsigned short bool;

#ifndef true
#define true            1
#endif

#ifndef false
#define false           0
#endif

//#define BAUD 115200
#define BAUD 9600

//----------------------------------------------------------------------------


//-------------------------- Прототипы функций: ------------------------------

void Port_Init(void);        			//инициализация порта
void Port_Read(void);        			//чтение данных порта
void Port_StartWrite(void);       //инициализация передачи пакета
void Port_Write(void);						//передача пакета
void Do_Crc8(char b, char *crc);  //вычисление контрольной суммы

//----------------------------------------------------------------------------

#endif
